БухЭксп/Documents/ОтражениеДОППВДекларацииПоКосвеннымНалогам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеДОППВДекларацииПоКосвеннымНалогам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КосвенныеНалогиСведенияИзДОПП</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.РасчетНачисленияНалоговНаЕНС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СведенияИзДокументовОПредстоящейПоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДОПП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрационныйНомерДОПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПоставкиТоваровИзЕАЭС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОприходования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбеспечительныеПлатежи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбеспечительныйПлатежКОтражению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоПриВвозе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДоплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/СостоянияПоставкиТоваровИзЕАЭС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияПоставкиТоваровИзЕАЭС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
					<Comment>Товары ввезены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидается</Name>
					<Comment>Ожидается ввоз товаров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
					<Comment>Отмена поставки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продолжается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/ОтражениеДОППВДекларацииПоКосвеннымНалогам/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьРеквизитыИзПараметровФормы(ЭтотОбъект);
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ОбновитьИтогиВПодвале(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
	ТекущаяОрганизация   = Объект.Организация;
	УчетНДСПереопределяемый.ПриСозданииНаСервереДокументаНДС(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	УчетНДСПереопределяемый.ПриЧтенииНаСервереДокументаНДС(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УчетНДСКлиентПереопределяемый.ПослеЗаписиДокументаНДС(ЭтотОбъект, ПараметрыЗаписи);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьСостояниеДокумента();
	
	УчетНДСПереопределяемый.ПослеЗаписиНаСервереДокументаНДС(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = УчетНДСКлиент.ПроверкаЗаписиСтрокТабличныхЧастей(ЭтотОбъект,
		ПараметрыПереносаСтрокТабличныхЧастей(ПараметрыЗаписи.РежимЗаписи));
		
	Если Отказ Тогда
		Возврат;     // Чтобы не вызывалось по умолчанию платформеннная ошибка "Табличная часть содержит более 99999 строк"
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроведениеСервер.УстановитьПризнакПроверкиРеквизитов(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РедактированиеОбеспечительныхПлатежей" Тогда
		
		КлючПоиска = Новый Структура("КлючСтроки", Параметр.КлючСтроки);
		
		НайденныеСтроки = Объект.СведенияИзДокументовОПредстоящейПоставке.НайтиСтроки(КлючПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		МассивСтрокОбеспечительныеПлатежи = Объект.ОбеспечительныеПлатежи.НайтиСтроки(КлючПоиска);
		Для Каждого СтрокаТЧ Из МассивСтрокОбеспечительныеПлатежи Цикл
			Объект.ОбеспечительныеПлатежи.Удалить(СтрокаТЧ);
		КонецЦикла;
		
		АдресТаблицыОбеспечительныеПлатежи = Параметр.АдресТаблицыОбеспечительныеПлатежи;
		ЗагрузитьОбеспечительныеПлатежиИзХранилища(Параметр.КлючСтроки);
		
	Иначе
		
		ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СведенияИзДокументовОПредстоящейПоставке.Количество() <> 0
		ИЛИ Объект.ОбеспечительныеПлатежи.Количество() <> 0 Тогда 
		ТекстВопроса = НСтр("ru = 'Необходимо очистить табличную часть. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПриИзмененииОрганизацииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		ПриИзмененииОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерПодсказкаНажатие(Элемент)
	
	ЗакрытьБаннерПодсказка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияИзДокументовОПредстоящейПоставке

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеОбеспечительныйПлатежПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяСтрока = Элементы.СведенияИзДокументовОПредстоящейПоставке.ТекущаяСтрока;
	ОткрытьФормуРедактированияОбеспечительногоПлатежа(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СведенияИзДокументовОПредстоящейПоставкеОбеспечительныйПлатежПредставление" Тогда
		ОткрытьФормуРедактированияОбеспечительногоПлатежа(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанныеСведенияИзДокументовОПредстоящейПоставке = Элементы.СведенияИзДокументовОПредстоящейПоставке.ТекущиеДанные;
		ТекДанныеСведенияИзДокументовОПредстоящейПоставке.КлючСтроки = Новый УникальныйИдентификатор;
		ТекДанныеСведенияИзДокументовОПредстоящейПоставке.ОбеспечительныйПлатежПредставление = "<...>";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.СведенияИзДокументовОПредстоящейПоставке.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для каждого ИдСтроки Из ВыделенныеСтроки Цикл
		ТекДанные = Объект.СведенияИзДокументовОПредстоящейПоставке.НайтиПоИдентификатору(ИдСтроки);
		Если ТекДанные <> Неопределено Тогда
			// Необходимо очистить дополнительные сведения
			НоваяСтрока = ТаблицаУдаленныхКлючей.Добавить();
			НоваяСтрока.КлючСтроки = ТекДанные.КлючСтроки;
		КонецЕсли;
	КонецЦикла;
	ПодключитьОбработчикОжидания("Подключаемый_УдалитьСвязанныеЗаписи", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьИтогиВПодвале(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеПослеУдаления(Элемент)
	ОбновитьИтогиВПодвале(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СведенияИзДокументовОПредстоящейПоставкеСостояниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СведенияИзДокументовОПредстоящейПоставке.ТекущиеДанные;
	Если ТекущиеДанные.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияПоставкиТоваровИзЕАЭС.Продолжается") Тогда
		ОтразитьИзменениеСтатусаПоставки(ТекущиеДанные.КлючСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Объект.СведенияИзДокументовОПредстоящейПоставке.Количество() > 0 Тогда 
		Если Объект.Проведен Тогда 
			ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличные части будут очищены. Заполнить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Табличные части будут очищены. Заполнить?'");
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДокументЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьЗаполнениеДокумента();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуРедактированияОбеспечительногоПлатежа(ВыбранноеЗначение)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект.СведенияИзДокументовОПредстоящейПоставке.НайтиПоИдентификатору(ВыбранноеЗначение);
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресТаблицыОбеспечительныеПлатежи", ПоместитьОбеспечительныеПлатежиВХранилище(ДанныеСтроки.КлючСтроки));
	ПараметрыФормы.Вставить("РазрешеноРедактироватьСуммуКОтражению", ДанныеСтроки.Состояние  = ПредопределенноеЗначение("Перечисление.СостоянияПоставкиТоваровИзЕАЭС.Продолжается"));
	ПараметрыФормы.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);
	ПараметрыФормы.Вставить("КлючСтроки", ДанныеСтроки.КлючСтроки);
	
	ОткрытьФорму("Документ.ОтражениеДОППВДекларацииПоКосвеннымНалогам.Форма.ФормаРедактированияОбеспечительныхПлатежей",
		ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОбеспечительныеПлатежиВХранилище(КлючСтроки)
	
	СтруктураОтбора = Новый Структура("КлючСтроки", КлючСтроки);
	ТаблицаОбеспечительныеПлатежи = Объект.ОбеспечительныеПлатежи.Выгрузить(СтруктураОтбора);
	АдресТаблицыОбеспечительныеПлатежи = ПоместитьВоВременноеХранилище(ТаблицаОбеспечительныеПлатежи, УникальныйИдентификатор);
	
	Возврат АдресТаблицыОбеспечительныеПлатежи;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОбеспечительныеПлатежиИзХранилища(КлючСтроки)
	
	ТаблицаОбеспечительныеПлатежи = ПолучитьИзВременногоХранилища(АдресТаблицыОбеспечительныеПлатежи);
	
	Для Каждого СтрокаТЧ Из ТаблицаОбеспечительныеПлатежи Цикл
		НоваяСтрока = Объект.ОбеспечительныеПлатежи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;
	
	КлючПоиска = Новый Структура("КлючСтроки", КлючСтроки);
	МассивСтрокДокументовОПредстоящейПоставке = Объект.СведенияИзДокументовОПредстоящейПоставке.НайтиСтроки(КлючПоиска);
	Если МассивСтрокДокументовОПредстоящейПоставке.Количество() > 0 Тогда 
		СтрокаТаблицы = МассивСтрокДокументовОПредстоящейПоставке[0];
		Если ТаблицаОбеспечительныеПлатежи.Количество() > 0 Тогда 
			ЗаполнитьОбеспечительныйПлатежПредставление(СтрокаТаблицы, ТаблицаОбеспечительныеПлатежи);
		Иначе
			СтрокаТаблицы.ОбеспечительныйПлатежПредставление = "<...>";
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьИтогиВПодвале(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеДокумента()

	ИБФайловая = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	Результат = ЗаполнитьДокументНаСервере(ИБФайловая);
	
	Если Результат.ЗаданиеВыполнено Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
		
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЗагрузитьПодготовленныеДанные();
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция ЗаполнитьДокументНаСервере(ИБФайловая)
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Объект.СведенияИзДокументовОПредстоящейПоставке.Очистить();
	Объект.ОбеспечительныеПлатежи.Очистить();
	
	СтруктураПараметров = Новый Структура("Организация, Дата, Ссылка", Объект.Организация, Объект.Дата, Объект.Ссылка);
	
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Документы.ОтражениеДОППВДекларацииПоКосвеннымНалогам.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров, АдресХранилища);
		Результат = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Отражение ДОПП в декларации по косвенным налогам""'");
		
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"Документы.ОтражениеДОППВДекларацииПоКосвеннымНалогам.ПодготовитьДанныеДляЗаполнения", 
			СтруктураПараметров,
			НаименованиеЗадания);
		
		АдресХранилища = Результат.АдресХранилища;
		
	КонецЕсли;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтогиВПодвале(ЭтотОбъект)
	
	Объект = ЭтотОбъект.Объект;
	
	ЭтотОбъект.ВсегоОбеспечительныйПлатеж = 
		ОбщегоНазначенияБПВызовСервера.ФорматСумм(Объект.ОбеспечительныеПлатежи.Итог("ОбеспечительныйПлатежКОтражению"));
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("СведенияИзДокументовОПредстоящейПоставке") Тогда
		Объект.СведенияИзДокументовОПредстоящейПоставке.Загрузить(СтруктураДанных.СведенияИзДокументовОПредстоящейПоставке);
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ОбеспечительныеПлатежи") Тогда
		Объект.ОбеспечительныеПлатежи.Загрузить(СтруктураДанных.ОбеспечительныеПлатежи);
	КонецЕсли;
	
	ОбновитьИтогиВПодвале(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОбеспечительныйПлатежПредставление(СтрокаТабличнойЧасти, ОбеспечительныеПлатежиПоСтроке)
	
	ОбеспечительныйПлатежПредставление = "";
	КоличествоОбеспечительныхПлатежей = ОбеспечительныеПлатежиПоСтроке.Количество();
	ОбеспечительныйПлатежПоСтроке = ОбеспечительныеПлатежиПоСтроке.Итог("ОбеспечительныйПлатежКОтражению");
	
	Если КоличествоОбеспечительныхПлатежей > 1 Тогда
		ОбеспечительныйПлатежПредставление = СтрШаблон(
			НСтр("ru = '%1 руб. по %2 КБК'"),
			ОбеспечительныйПлатежПоСтроке,
			КоличествоОбеспечительныхПлатежей);
	Иначе
		ОбеспечительныйПлатежПредставление = СтрШаблон(
			НСтр("ru = '%1 руб.'"),
			ОбеспечительныйПлатежПоСтроке);
	КонецЕсли;
		
	СтрокаТабличнойЧасти.ОбеспечительныйПлатежПредставление = ОбеспечительныйПлатежПредставление;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыИзПараметровФормы(ЭтотОбъект)
	
	ПараметрыЗаполненияФормы = Неопределено;
	
	Если ЭтотОбъект.Параметры.Свойство("ПараметрыЗаполненияФормы",ПараметрыЗаполненияФормы) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Объект,ПараметрыЗаполненияФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СведенияИзДокументовОПредстоящейПоставкеРегистрационныйНомерДОПП");
	ГруппаОтбора1 = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
				"Объект.СведенияИзДокументовОПредстоящейПоставке.Состояние", ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.СостоянияПоставкиТоваровИзЕАЭС.Ожидается);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора1,
				"Объект.СведенияИзДокументовОПредстоящейПоставке.РегистрационныйНомерДОПП", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьСвязанныеЗаписи()
	
	УдалитьСвязанныеЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСвязанныеЗаписиНаСервере()
	
	Для каждого СтрокаКлюча Из ТаблицаУдаленныхКлючей Цикл
		КлючПоиска = Новый Структура("КлючСтроки", СтрокаКлюча.КлючСтроки);
		МассивСтрокТовары = Объект.ОбеспечительныеПлатежи.НайтиСтроки(КлючПоиска);
		
		Для каждого СтрокаТЧ Из МассивСтрокТовары Цикл
			Объект.ОбеспечительныеПлатежи.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаУдаленныхКлючей.Очистить(); 
	ОбновитьИтогиВПодвале(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьИзменениеСтатусаПоставки(КлючСтроки)
	
	КлючПоиска = Новый Структура("КлючСтроки", КлючСтроки);
	МассивСтрокДокументовОПредстоящейПоставке = Объект.СведенияИзДокументовОПредстоящейПоставке.НайтиСтроки(КлючПоиска); 
	
	Если МассивСтрокДокументовОПредстоящейПоставке.Количество() > 0 Тогда
		СтрокаТаблицыДОПП = МассивСтрокДокументовОПредстоящейПоставке[0];
		МассивСтрокОбеспечительныеПлатежи = Объект.ОбеспечительныеПлатежи.НайтиСтроки(КлючПоиска);
		
		Для каждого СтрокаОбеспечительныйПлатеж Из МассивСтрокОбеспечительныеПлатежи Цикл
			Если (СтрокаТаблицыДОПП.Состояние = Перечисления.СостоянияПоставкиТоваровИзЕАЭС.Отменена
			  Или СтрокаТаблицыДОПП.Состояние = Перечисления.СостоянияПоставкиТоваровИзЕАЭС.Завершена)
			    И СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежКОтражению = 0 Тогда
				СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежКОтражению = СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежВсего;
				СтрокаОбеспечительныйПлатеж.КДоплате = СтрокаОбеспечительныйПлатеж.НачисленоПриВвозе - СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежВсего;
			ИначеЕсли СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежКОтражению <> 0
				    И СтрокаТаблицыДОПП.Состояние = Перечисления.СостоянияПоставкиТоваровИзЕАЭС.Ожидается Тогда
				СтрокаОбеспечительныйПлатеж.ОбеспечительныйПлатежКОтражению = 0;
				СтрокаОбеспечительныйПлатеж.КДоплате = 0;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОбеспечительныеПлатежи = Объект.ОбеспечительныеПлатежи.Выгрузить(КлючПоиска);
		ЗаполнитьОбеспечительныйПлатежПредставление(СтрокаТаблицыДОПП, ТаблицаОбеспечительныеПлатежи);
	КонецЕсли;
	
	ОбновитьИтогиВПодвале(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииОрганизацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.СведенияИзДокументовОПредстоящейПоставке.Очистить();
		Объект.ОбеспечительныеПлатежи.Очистить();
		ОбновитьИтогиВПодвале(ЭтотОбъект);
	Иначе
		Объект.Организация = ТекущаяОрганизация;
	КонецЕсли;
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()
	
	ТекущаяОрганизация = Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПереносаСтрокТабличныхЧастей(РежимЗаписи)
	
	ПараметрыСтрокТЧ = Новый Структура;
	
	ПодчиненныеТабличныеЧасти = Новый Массив;
	ПодчиненныеТабличныеЧасти.Добавить("ОбеспечительныеПлатежи");
	
	ПараметрыСтрокТЧ.Вставить("ПодчиненныеТабличныеЧасти", ПодчиненныеТабличныеЧасти);
	ПараметрыСтрокТЧ.Вставить("КоличествоСтрокДляПереноса", 0);
	
	ТабличныеЧасти = Новый Соответствие;
	ТабличныеЧасти.Вставить("СведенияИзДокументовОПредстоящейПоставке", ПараметрыСтрокТЧ);
	
	РеквизитыДокумента = "Дата, Организация, РучнаяКорректировка, Ответственный";
	
	ПараметрыПереносаСтрокТЧ = Новый Структура;
	ПараметрыПереносаСтрокТЧ.Вставить("ТабличныеЧасти", ТабличныеЧасти);
	ПараметрыПереносаСтрокТЧ.Вставить("РеквизитыДокумента", РеквизитыДокумента);
	ПараметрыПереносаСтрокТЧ.Вставить("РежимЗаписи", РежимЗаписи);
	
	Возврат ПараметрыПереносаСтрокТЧ;
	
КонецФункции

&НаКлиенте
Процедура ВопросПеренестиСтрокиТабличныхЧастейВДругойДокументЗавершение(Результат, ПараметрыПереносаСтрокТЧ) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УчетНДСКлиент.ПеренестиСтрокиТабличныхЧастейВДругойДокумент(ПараметрыПереносаСтрокТЧ);
	КонецЕсли;
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьБаннерПодсказка()
	
	Элементы.ГруппаПодсказкаПоСтатусамПоставки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
